// @strict-types

#Область ОбработчикиСобытийЭлементовТаблицыФормыНоменклатура
&НаКлиенте
Процедура НоменклатураЦенаПриИзменении(Элемент)
	СтрокаТабличнойЧасти = Элементы.Номенклатура.ТекущиеДанные;
	СтрокаТабличнойЧасти.Сумма = СтрокаТабличнойЧасти.Цена * СтрокаТабличнойЧасти.Количество;
КонецПроцедуры
// @strict-types
&НаКлиенте
Процедура НоменклатураКоличествоПриИзменении(Элемент)
	СтрокаТабличнойЧасти = Элементы.Номенклатура.ТекущиеДанные;
	СтрокаТабличнойЧасти.Сумма = СтрокаТабличнойЧасти.Цена * СтрокаТабличнойЧасти.Количество;
КонецПроцедуры

#КонецОбласти