// @strict-types

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, Режим)
	
	// регистр ДвиженияТоваров Расход
	Движения.ДвиженияТоваров.Записывать = Истина;
	Для Каждого ТекСтрокаНоменклатура Из Номенклатура Цикл
		Движение = Движения.ДвиженияТоваров.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Склад = Склад;
		Движение.Товар = ТекСтрокаНоменклатура.Товар;
		Движение.Количество = ТекСтрокаНоменклатура.Количество;
	КонецЦикла;

КонецПроцедуры

#КонецОбласти
