// @strict-types
#Область ПрограммныйИнтерфейс

// Складывает две переменные
// Параметры:
//  ПеремА - Число 
//  ПеремБ - Число
// Возвращаемое значение:
//  Число
Функция СложениеПеременных(ПеремА, ПеремБ) Экспорт

	Результат = ПеремА + ПеремБ;
	Возврат Результат;

КонецФункции

// Вычитает одну переменную из другой
// Параметры:
//  ПеремА - Число 
//  ПеремБ - Число
// Возвращаемое значение:
//  Число
Функция ВычитаниеПеременных(ПеремА, ПеремБ) Экспорт

	Результат = ПеремА - ПеремБ;
	Возврат Результат;

КонецФункции

// Умножает одну переменную на другую
// Параметры:
//  ПеремА - Число 
//  ПеремБ - Число
// Возвращаемое значение:
//  Число
Функция УмножениеПеременных(ПеремА, ПеремБ) Экспорт

	Результат = ПеремА * ПеремБ;
	Возврат Результат;

КонецФункции

// Делит одну переменную на другую
// Параметры:
//  ПеремА - Число 
//  ПеремБ - Число
// Возвращаемое значение:
//  Число
Функция ДелениеПеременных(ПеремА, ПеремБ) Экспорт

	Результат = ПеремА / ПеремБ;
	Возврат Результат; 

КонецФункции

#КонецОбласти