// @strict-types

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыгрузитьВЭксель(Команда)
	
	Режим = РежимДиалогаВыбораФайла.ВыборКаталога;
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(Режим);
	ДиалогОткрытияФайла.Каталог = "";
	ДиалогОткрытияФайла.МножественныйВыбор = Ложь;
	ДиалогОткрытияФайла.Заголовок = "Выберите каталог для выгрузки";
	
	Если ДиалогОткрытияФайла.Выбрать() Тогда
		ПутьККаталогу = ДиалогОткрытияФайла.Каталог;
	КонецЕсли;

	Если Прав(ПутьККаталогу, 1) <> "\" Тогда
		Объект.КаталогСохранения = ПутьККаталогу + "\";
	Иначе
		Объект
	
КонецПроцедуры

#КонецОбласти

