#Область СлужебныйПрограммныйИнтерфейс

Процедура ИсполняемыеСценарии() Экспорт
	
	ЮТТесты
		.ДобавитьТест("СложениеПеременных")
			.СПараметрами(2, 3, 5)
			.СПараметрами(2, -3, -1)
			.СПараметрами(0, 1, 1)
			.СПараметрами("2", "-3", "2-3")
			.СПараметрами("2", -3, "2-3")
		.ДобавитьТест("ВычитаниеПеременных")
			.СПараметрами(2, 3, -1)
			.СПараметрами(2, -3, 5)
			.СПараметрами(0, 1, -1)
			.СПараметрами(-2, -3, 1)
			.СПараметрами(0, -5, 5)
		.ДобавитьТест("УмножениеПеременных")
			.СПараметрами(2, 3, 6)
			.СПараметрами(2, -3, -6)
			.СПараметрами(0, 1, 0)
			.СПараметрами(1, -1, -1)
			.СПараметрами(-2, -3, 6)
		.ДобавитьТест("ДелениеПеременных")
			.СПараметрами(21, 3, 7)
			.СПараметрами(20, 5, 4)
			.СПараметрами(0, 1, 0)
			.СПараметрами(-20, -5, 4)
			.СПараметрами(80, -5, -16)
	;
	
КонецПроцедуры

Процедура СложениеПеременных(ПеремА, ПеремБ, Результат) Экспорт
	
	РезультатСложения = ПеремА + ПеремБ;
	ЮТест.ОжидаетЧто(РезультатСложения)
		.Равно(Результат);
	
КонецПроцедуры

Процедура ВычитаниеПеременных(ПеремА, ПеремБ, Результат) Экспорт
	
	РезультатВычитания = ПеремА - ПеремБ;
	ЮТест.ОжидаетЧто(РезультатВычитания)
		.Равно(Результат);
	
КонецПроцедуры

Процедура УмножениеПеременных(ПеремА, ПеремБ, Результат) Экспорт
	
	РезультатУмножения = ПеремА * ПеремБ;
	ЮТест.ОжидаетЧто(РезультатУмножения)
		.Равно(Результат);
	
КонецПроцедуры

Процедура ДелениеПеременных(ПеремА, ПеремБ, Результат) Экспорт
	
	РезультатДеления = ПеремА / ПеремБ;
	ЮТест.ОжидаетЧто(РезультатДеления)
		.Равно(Результат);
	
КонецПроцедуры

#КонецОбласти
