#Область ОбработчикиКомандФормы

// Параметры:
//  КоличествоПриходов - Число
//  Команда - КомандаФормы
&НаКлиенте
Процедура СоздатьПриходы(Команда)

	КоличествоПриходов = Объект.КоличествоПриходов;

	Если КоличествоПриходов <= 0 Тогда
		Сообщить("Введите количество больше нуля");
		Возврат;
	КонецЕсли;

	МассивСсылок = СоздатьПриходыНаСервере(КоличествоПриходов);
	Сообщить("Создано документов: " + МассивСсылок.Количество());

КонецПроцедуры

// Параметры:
//  КоличествоРасходов - Число
//  Команда - КомандаФормы
&НаКлиенте
Процедура СоздатьРасходы(Команда)

	Если Объект.КоличествоРасходов <= 0 Тогда
		Сообщить("Введите количество больше нуля");
		Возврат;
	КонецЕсли;

	МассивСсылок = СоздатьРасходыНаСервере(Объект.КоличествоРасходов);
	Сообщить("Создано документов: " + МассивСсылок.Количество());

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Параметры:
//  Количество - Число
&НаСервере
Функция СоздатьПриходыНаСервере(Количество)

	МассивСсылок = Новый Массив;
	ГСЧ = Новый ГенераторСлучайныхЧисел();

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Склады.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Склад КАК Склады";

	ВыборкаСкладов = Запрос.Выполнить().Выбрать();
	МассивСкладов = Новый Массив;

	Пока ВыборкаСкладов.Следующий() Цикл
		МассивСкладов.Добавить(ВыборкаСкладов.Ссылка);
	КонецЦикла;

	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Поставщики.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Поставщики КАК Поставщики";

	ВыборкаПоставщиков = Запрос.Выполнить().Выбрать();
	МассивПоставщиков = Новый Массив;

	Пока ВыборкаПоставщиков.Следующий() Цикл
		МассивПоставщиков.Добавить(ВыборкаПоставщиков.Ссылка);
	КонецЦикла;

	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Номенклатура.Ссылка КАК Ссылка,
		|	Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура";

	ВыборкаНоменклатуры = Запрос.Выполнить().Выбрать();
	МассивНоменклатуры = Новый Массив;

	Пока ВыборкаНоменклатуры.Следующий() Цикл
		СтрокаНоменклатуры = Новый Структура("Ссылка, ЕдиницаИзмерения");
		СтрокаНоменклатуры.Ссылка = ВыборкаНоменклатуры.Ссылка;
		СтрокаНоменклатуры.ЕдиницаИзмерения = ВыборкаНоменклатуры.ЕдиницаИзмерения;
		МассивНоменклатуры.Добавить(СтрокаНоменклатуры);
	КонецЦикла;

	Если МассивСкладов.Количество() = 0 Тогда
		ВызватьИсключение("Справочник ""Склад"" пуст");
	КонецЕсли;

	Если МассивПоставщиков.Количество() = 0 Тогда
		ВызватьИсключение("Справочник ""Поставщики"" пуст");
	КонецЕсли;

	Если МассивНоменклатуры.Количество() = 0 Тогда
		ВызватьИсключение("Справочник ""Номенклатура"" пуст");
	КонецЕсли;

	Для Счетчик = 1 По Количество Цикл

		НовыйДокумент = Документы.Приход.СоздатьДокумент();
		НовыйДокумент.Дата = ТекущаяДатаСеанса();
		НовыйДокумент.Склад = МассивСкладов[ГСЧ.СлучайноеЧисло(0, МассивСкладов.Количество() - 1)];
		НовыйДокумент.Поставщик = МассивПоставщиков[ГСЧ.СлучайноеЧисло(0, МассивПоставщиков.Количество() - 1)];

		МаксСтрок = ?(МассивНоменклатуры.Количество() < 5, МассивНоменклатуры.Количество(), 5);
		КоличествоСтрокВДокументе = ГСЧ.СлучайноеЧисло(1, МаксСтрок);
		ИспользованнаяНоменклатура = Новый Массив;

		Для Стр = 1 По КоличествоСтрокВДокументе Цикл
			СлучайнаяНоменклатура = Неопределено;
			Попыток = 0;
			Пока СлучайнаяНоменклатура = Неопределено И Попыток < 100 Цикл

			Кандидат = МассивНоменклатуры[ГСЧ.СлучайноеЧисло(0, МассивНоменклатуры.Количество() - 1)];
			
				Если ИспользованнаяНоменклатура.Найти(Кандидат.Ссылка) = Неопределено Тогда
					СлучайнаяНоменклатура = Кандидат;
					ИспользованнаяНоменклатура.Добавить(Кандидат.Ссылка);
				КонецЕсли;

				Попыток = Попыток + 1;

			КонецЦикла;

			Если СлучайнаяНоменклатура = Неопределено Тогда
				Прервать;
			КонецЕсли;

			НоваяСтрока = НовыйДокумент.Номенклатура.Добавить();
			НоваяСтрока.Товар = СлучайнаяНоменклатура.Ссылка;
			НоваяСтрока.ЕдиницаИзмерения = СлучайнаяНоменклатура.ЕдиницаИзмерения;
			НоваяСтрока.Количество = ГСЧ.СлучайноеЧисло(1, 100);
			НоваяСтрока.Цена = ГСЧ.СлучайноеЧисло(100, 1000);
			НоваяСтрока.Сумма = НоваяСтрока.Количество * НоваяСтрока.Цена;

		КонецЦикла;

		НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение);
		МассивСсылок.Добавить(НовыйДокумент.Ссылка);

	КонецЦикла;

	Возврат МассивСсылок;

КонецФункции

// Параметры:
//  Количество - Число
&НаСервере
Функция СоздатьРасходыНаСервере(Количество)

	МассивСсылок = Новый Массив;
	ГСЧ = Новый ГенераторСлучайныхЧисел();

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Склады.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Склад КАК Склады";

	ВыборкаСкладов = Запрос.Выполнить().Выбрать();
	МассивСкладов = Новый Массив;

	Пока ВыборкаСкладов.Следующий() Цикл
		МассивСкладов.Добавить(ВыборкаСкладов.Ссылка);
	КонецЦикла;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Поставщики.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Поставщики КАК Поставщики";

	ВыборкаПолучателей = Запрос.Выполнить().Выбрать();
	МассивПолучателей = Новый Массив;

	Пока ВыборкаПолучателей.Следующий() Цикл
		МассивПолучателей.Добавить(ВыборкаПолучателей.Ссылка);
	КонецЦикла;

	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Номенклатура.Ссылка КАК Ссылка,
		|	Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура";

	ВыборкаНоменклатуры = Запрос.Выполнить().Выбрать();
	МассивНоменклатуры = Новый Массив;

	Пока ВыборкаНоменклатуры.Следующий() Цикл
		СтрокаНоменклатуры = Новый Структура("Ссылка, ЕдиницаИзмерения");
		СтрокаНоменклатуры.Ссылка = ВыборкаНоменклатуры.Ссылка;
		СтрокаНоменклатуры.ЕдиницаИзмерения = ВыборкаНоменклатуры.ЕдиницаИзмерения;
		МассивНоменклатуры.Добавить(СтрокаНоменклатуры);
	КонецЦикла;

	Если МассивСкладов.Количество() = 0 Тогда
		ВызватьИсключение("Справочник ""Склад"" пуст");
	КонецЕсли;

	Если МассивПолучателей.Количество() = 0 Тогда
		ВызватьИсключение("Справочник ""Поставщики"" пуст");
	КонецЕсли;

	Если МассивНоменклатуры.Количество() = 0 Тогда
		ВызватьИсключение("Справочник ""Номенклатура"" пуст");
	КонецЕсли;

	Для Счетчик = 1 По Количество Цикл

		НовыйДокумент = Документы.Расход.СоздатьДокумент();
		НовыйДокумент.Дата = ТекущаяДатаСеанса();
		НовыйДокумент.Склад = МассивСкладов[ГСЧ.СлучайноеЧисло(0, МассивСкладов.Количество() - 1)];
		НовыйДокумент.Поставщик = МассивПолучателей[ГСЧ.СлучайноеЧисло(0, МассивПолучателей.Количество() - 1)];
		
		МаксСтрок = ?(МассивНоменклатуры.Количество() < 5, МассивНоменклатуры.Количество(), 5);
		КоличествоСтрокВДокументе = ГСЧ.СлучайноеЧисло(1, МаксСтрок);
		ИспользованнаяНоменклатура = Новый Массив;

		Для Стр = 1 По КоличествоСтрокВДокументе Цикл

			СлучайнаяНоменклатура = Неопределено;
			Попыток = 0;

			Пока СлучайнаяНоменклатура = Неопределено И Попыток < 100 Цикл

				Кандидат = МассивНоменклатуры[ГСЧ.СлучайноеЧисло(0, МассивНоменклатуры.Количество() - 1)];

				Если ИспользованнаяНоменклатура.Найти(Кандидат.Ссылка) = Неопределено Тогда
					СлучайнаяНоменклатура = Кандидат;
					ИспользованнаяНоменклатура.Добавить(Кандидат.Ссылка);
				КонецЕсли;

				Попыток = Попыток + 1;

			КонецЦикла;

			Если СлучайнаяНоменклатура = Неопределено Тогда
				Прервать;
			КонецЕсли;

			НоваяСтрока = НовыйДокумент.Номенклатура.Добавить();
			НоваяСтрока.Товар = СлучайнаяНоменклатура.Ссылка;
			НоваяСтрока.ЕдиницаИзмерения = СлучайнаяНоменклатура.ЕдиницаИзмерения;
			НоваяСтрока.Количество = ГСЧ.СлучайноеЧисло(1, 10);
			НоваяСтрока.Цена = ГСЧ.СлучайноеЧисло(100, 1000);
			НоваяСтрока.Сумма = НоваяСтрока.Количество * НоваяСтрока.Цена;

		КонецЦикла;

		НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение);
		МассивСсылок.Добавить(НовыйДокумент.Ссылка);

	КонецЦикла;

	Возврат МассивСсылок;

КонецФункции

#КонецОбласти